// "Компонент, що  випадаючим списком, в якому розміщено кнопки:
// -Profile settings - клік по даній кнопці відкриває модалку UserSetsModal, в якій юзер може змінити особисті дані
// -Log out - клік по даній кнопці виконує логаут юзера. В результаті якого юзер переадресовуються на сторінку WelcomePage, а також обнуляє всі дані поточного юзера, які зберігаються в глобальному стейті.

// Після відкриття модалки UserSetsModal або виконання логауту юзера, даний випадаючий список повинен бути закритим."
