import css from './UserBarBtn.module.css'
const UserBarBtn = () => {
    return <button className={css.UserBarBtn}>UserBarBtn</button>
}
export default UserBarBtn;

// "Компонент рендерить кнопку, яка складається з: 
// -аватару юзера, а зайого відсутності з першої літери імені юзера в верхньому регістрі,
// -імені юзера,
// -та іконки, яка показує стрілку з напрмками вниз/вверх в залежності від того закрито чи відкрито компонент UserPanel
// Клік по кнопці відкриває/закриває компонент UserPanel, який є випадаючим списком з кнопками."